renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx260/register_access/iccrx/iodefine.h
#ifdef __IAR_SYSTEMS_ICC__
#pragma language=save
#pragma language=extended
#ifndef _SYSTEM_BUILD
#pragma system_include
#endif
#endif

#ifdef __IAR_SYSTEMS_ICC__
#define __evenaccess
#else
#define __sfr
#endif



#define	IEN_BSC_BUSERR		IEN0
#define	IEN_RAM_RAMERR		IEN2
#define	IEN_FCU_FRDYI		IEN7
#define	IEN_ICU_SWINT		IEN3
#define	IEN_CMT0_CMI0		IEN4
#define	IEN_CMT1_CMI1		IEN5
#define	IEN_CMT2_CMI2		IEN6
#define	IEN_CMT3_CMI3		IEN7
#define	IEN_CAC_FERRF		IEN0
#define	IEN_CAC_MENDF		IEN1
#define	IEN_CAC_OVFF		IEN2
#define	IEN_USB0_D0FIFO0	IEN4
#define	IEN_USB0_D1FIFO0	IEN5
#define	IEN_USB0_USBI0		IEN6
#define	IEN_POEG_POEGGAI	IEN0
#define	IEN_POEG_POEGGBI	IEN1
#define	IEN_POEG_POEGGCI	IEN2
#define	IEN_POEG_POEGGDI	IEN3
#define	IEN_RSPI0_SPEI0		IEN4
#define	IEN_RSPI0_SPRI0		IEN5
#define	IEN_RSPI0_SPTI0		IEN6
#define	IEN_RSPI0_SPII0		IEN7
#define	IEN_DOC_DOPCF		IEN1
#define	IEN_CMPB_CMPB0		IEN2
#define	IEN_CMPB_CMPB1		IEN3
#define	IEN_CTSU_CTSUWR		IEN4
#define	IEN_CTSU_CTSURD		IEN5
#define	IEN_CTSU_CTSUFN		IEN6
#define	IEN_RTC_CUP			IEN7
#define	IEN_ICU_IRQ0		IEN0
#define	IEN_ICU_IRQ1		IEN1
#define	IEN_ICU_IRQ2		IEN2
#define	IEN_ICU_IRQ3		IEN3
#define	IEN_ICU_IRQ4		IEN4
#define	IEN_ICU_IRQ5		IEN5
#define	IEN_ICU_IRQ6		IEN6
#define	IEN_ICU_IRQ7		IEN7
#define	IEN_ELC_ELSR8I		IEN0
#define	IEN_SYSTEM_SNZI		IEN1
#define	IEN_LVD_LVD1		IEN0
#define	IEN_LVD_LVD2		IEN1
#define	IEN_USB0_USBR0		IEN2
#define	IEN_RTC_ALM			IEN4
#define	IEN_RTC_PRD			IEN5
#define	IEN_REMC0_REMCI0	IEN6
#define	IEN_S12AD_S12ADI0	IEN6
#define	IEN_S12AD_GBADI		IEN7
#define	IEN_ELC_ELSR18I		IEN2
#define	IEN_ELC_ELSR19I		IEN3
#define	IEN_GPTW0_GTCIA0	IEN4
#define	IEN_GPTW0_GTCIB0	IEN5
#define	IEN_GPTW0_GTCIC0	IEN6
#define	IEN_GPTW0_GTCID0	IEN7
#define	IEN_GPTW0_GTCIE0	IEN0
#define	IEN_GPTW0_GTCIF0	IEN1
#define	IEN_GPTW0_GTCIV0	IEN2
#define	IEN_GPTW0_GTCIU0	IEN3
#define	IEN_GPTW1_GTCIA1	IEN4
#define	IEN_GPTW1_GTCIB1	IEN5
#define	IEN_GPTW1_GTCIC1	IEN6
#define	IEN_GPTW1_GTCID1	IEN7
#define	IEN_GPTW1_GTCIE1	IEN0
#define	IEN_GPTW1_GTCIF1	IEN1
#define	IEN_GPTW1_GTCIV1	IEN2
#define	IEN_GPTW1_GTCIU1	IEN3
#define	IEN_GPTW2_GTCIA2	IEN4
#define	IEN_GPTW2_GTCIB2	IEN5
#define	IEN_GPTW2_GTCIC2	IEN6
#define	IEN_GPTW2_GTCID2	IEN7
#define	IEN_GPTW2_GTCIE2	IEN0
#define	IEN_GPTW2_GTCIF2	IEN1
#define	IEN_GPTW2_GTCIV2	IEN2
#define	IEN_GPTW2_GTCIU2	IEN3
#define	IEN_GPTW3_GTCIA3	IEN4
#define	IEN_GPTW3_GTCIB3	IEN5
#define	IEN_GPTW3_GTCIC3	IEN6
#define	IEN_GPTW3_GTCID3	IEN7
#define	IEN_GPTW3_GTCIE3	IEN0
#define	IEN_GPTW3_GTCIF3	IEN1
#define	IEN_GPTW3_GTCIV3	IEN2
#define	IEN_GPTW3_GTCIU3	IEN3
#define	IEN_GPTW4_GTCIA4	IEN4
#define	IEN_GPTW4_GTCIB4	IEN5
#define	IEN_GPTW4_GTCIC4	IEN6
#define	IEN_GPTW4_GTCID4	IEN7
#define	IEN_GPTW4_GTCIE4	IEN0
#define	IEN_GPTW4_GTCIF4	IEN1
#define	IEN_GPTW4_GTCIV4	IEN2
#define	IEN_GPTW4_GTCIU4	IEN3
#define	IEN_GPTW5_GTCIA5	IEN4
#define	IEN_GPTW5_GTCIB5	IEN5
#define	IEN_GPTW5_GTCIC5	IEN6
#define	IEN_GPTW5_GTCID5	IEN7
#define	IEN_GPTW5_GTCIE5	IEN0
#define	IEN_GPTW5_GTCIF5	IEN1
#define	IEN_GPTW5_GTCIV5	IEN2
#define	IEN_GPTW5_GTCIU5	IEN3
#define	IEN_GPTW6_GTCIA6	IEN4
#define	IEN_GPTW6_GTCIB6	IEN5
#define	IEN_GPTW6_GTCIC6	IEN6
#define	IEN_GPTW6_GTCID6	IEN7
#define	IEN_GPTW6_GTCIE6	IEN0
#define	IEN_GPTW6_GTCIF6	IEN1
#define	IEN_GPTW6_GTCIV6	IEN2
#define	IEN_GPTW6_GTCIU6	IEN3
#define	IEN_GPTW7_GTCIA7	IEN4
#define	IEN_GPTW7_GTCIB7	IEN5
#define	IEN_GPTW7_GTCIC7	IEN6
#define	IEN_GPTW7_GTCID7	IEN7
#define	IEN_GPTW7_GTCIE7	IEN0
#define	IEN_GPTW7_GTCIF7	IEN1
#define	IEN_GPTW7_GTCIV7	IEN2
#define	IEN_GPTW7_GTCIU7	IEN3
#define	IEN_TMR0_CMIA0		IEN6
#define	IEN_TMR0_CMIB0		IEN7
#define	IEN_TMR0_OVI0		IEN0
#define	IEN_TMR1_CMIA1		IEN1
#define	IEN_TMR1_CMIB1		IEN2
#define	IEN_TMR1_OVI1		IEN3
#define	IEN_TMR2_CMIA2		IEN4
#define	IEN_TMR2_CMIB2		IEN5
#define	IEN_TMR2_OVI2		IEN6
#define	IEN_TMR3_CMIA3		IEN7
#define	IEN_TMR3_CMIB3		IEN0
#define	IEN_TMR3_OVI3		IEN1
#define	IEN_CANFD_RFRI		IEN2
#define	IEN_CANFD_GLEI		IEN3
#define	IEN_CANFD_RMRI		IEN4
#define	IEN_CANFD_RFDREQ0	IEN5
#define	IEN_CANFD_RFDREQ1	IEN6
#define	IEN_CANFD_EC1EI		IEN7
#define	IEN_CANFD_EC2EI		IEN0
#define	IEN_CANFD_ECOVI		IEN1
#define	IEN_CANFD0_CHTI		IEN2
#define	IEN_CANFD0_CHEI		IEN3
#define	IEN_CANFD0_CFRI		IEN4
#define	IEN_CANFD0_CFDREQ0	IEN5
#define	IEN_DMAC_DMAC0I		IEN6
#define	IEN_DMAC_DMAC1I		IEN7
#define	IEN_DMAC_DMAC2I		IEN0
#define	IEN_DMAC_DMAC3I		IEN1
#define	IEN_RSIP_PROC_BUSY	IEN2
#define	IEN_RSIP_ROMOK		IEN3
#define	IEN_RSIP_LONG_PLG	IEN4
#define	IEN_RSIP_TEST_BUSY	IEN5
#define	IEN_RSIP_WRRDY0		IEN6
#define	IEN_RSIP_WRRDY2		IEN7
#define	IEN_RSIP_RDRDY0		IEN0
#define	IEN_RSIP_INTEGRATE_RDRDY	IEN1
#define	IEN_RSIP_INTEGRATE_WRRDY	IEN2
#define	IEN_RSIP_ECCERR		IEN3
#define	IEN_RSCI9_BFD		IEN4
#define	IEN_RSCI9_AED		IEN5
#define	IEN_RSCI0_ERI		IEN6
#define	IEN_RSCI0_RXI		IEN7
#define	IEN_RSCI0_TXI		IEN0
#define	IEN_RSCI0_TEI		IEN1
#define	IEN_SCI1_ERI1		IEN2
#define	IEN_SCI1_RXI1		IEN3
#define	IEN_SCI1_TXI1		IEN4
#define	IEN_SCI1_TEI1		IEN5
#define	IEN_SCI5_ERI5		IEN6
#define	IEN_SCI5_RXI5		IEN7
#define	IEN_SCI5_TXI5		IEN0
#define	IEN_SCI5_TEI5		IEN1
#define	IEN_SCI6_ERI6		IEN2
#define	IEN_SCI6_RXI6		IEN3
#define	IEN_SCI6_TXI6		IEN4
#define	IEN_SCI6_TEI6		IEN5
#define	IEN_RSCI8_ERI		IEN6
#define	IEN_RSCI8_RXI		IEN7
#define	IEN_RSCI8_TXI		IEN0
#define	IEN_RSCI8_TEI		IEN1
#define	IEN_RSCI9_ERI		IEN2
#define	IEN_RSCI9_RXI		IEN3
#define	IEN_RSCI9_TXI		IEN4
#define	IEN_RSCI9_TEI		IEN5
#define	IEN_SCI12_ERI12		IEN6
#define	IEN_SCI12_RXI12		IEN7
#define	IEN_SCI12_TXI12		IEN0
#define	IEN_SCI12_TEI12		IEN1
#define	IEN_SCI12_SCIX0		IEN2
#define	IEN_SCI12_SCIX1		IEN3
#define	IEN_SCI12_SCIX2		IEN4
#define	IEN_SCI12_SCIX3		IEN5
#define	IEN_RIIC0_EEI0		IEN6
#define	IEN_RIIC0_RXI0		IEN7
#define	IEN_RIIC0_TXI0		IEN0
#define	IEN_RIIC0_TEI0		IEN1
#define	IEN_LPT_LPTCMI1		IEN7

#define	VECT_BSC_BUSERR		16
#define	VECT_RAM_RAMERR		18
#define	VECT_FCU_FRDYI		23
#define	VECT_ICU_SWINT		27
#define	VECT_CMT0_CMI0		28
#define	VECT_CMT1_CMI1		29
#define	VECT_CMT2_CMI2		30
#define	VECT_CMT3_CMI3		31
#define	VECT_CAC_FERRF		32
#define	VECT_CAC_MENDF		33
#define	VECT_CAC_OVFF		34
#define	VECT_USB0_D0FIFO0	36
#define	VECT_USB0_D1FIFO0	37
#define	VECT_USB0_USBI0		38
#define	VECT_POEG_POEGGAI	40
#define	VECT_POEG_POEGGBI	41
#define	VECT_POEG_POEGGCI	42
#define	VECT_POEG_POEGGDI	43
#define	VECT_RSPI0_SPEI0	44
#define	VECT_RSPI0_SPRI0	45
#define	VECT_RSPI0_SPTI0	46
#define	VECT_RSPI0_SPII0	47
#define	VECT_DOC_DOPCF		57
#define	VECT_CMPB_CMPB0		58
#define	VECT_CMPB_CMPB1		59
#define	VECT_CTSU_CTSUWR	60
#define	VECT_CTSU_CTSURD	61
#define	VECT_CTSU_CTSUFN	62
#define	VECT_RTC_CUP		63
#define	VECT_ICU_IRQ0		64
#define	VECT_ICU_IRQ1		65
#define	VECT_ICU_IRQ2		66
#define	VECT_ICU_IRQ3		67
#define	VECT_ICU_IRQ4		68
#define	VECT_ICU_IRQ5		69
#define	VECT_ICU_IRQ6		70
#define	VECT_ICU_IRQ7		71
#define	VECT_ELC_ELSR8I		80
#define	VECT_SYSTEM_SNZI	81
#define	VECT_LVD_LVD1		88
#define	VECT_LVD_LVD2		89
#define	VECT_USB0_USBR0		90
#define	VECT_RTC_ALM		92
#define	VECT_RTC_PRD		93
#define	VECT_REMC0_REMCI0	94
#define	VECT_S12AD_S12ADI0	102
#define	VECT_S12AD_GBADI	103
#define	VECT_ELC_ELSR18I	106
#define	VECT_ELC_ELSR19I	107
#define	VECT_GPTW0_GTCIA0	108
#define	VECT_GPTW0_GTCIB0	109
#define	VECT_GPTW0_GTCIC0	110
#define	VECT_GPTW0_GTCID0	111
#define	VECT_GPTW0_GTCIE0	112
#define	VECT_GPTW0_GTCIF0	113
#define	VECT_GPTW0_GTCIV0	114
#define	VECT_GPTW0_GTCIU0	115
#define	VECT_GPTW1_GTCIA1	116
#define	VECT_GPTW1_GTCIB1	117
#define	VECT_GPTW1_GTCIC1	118
#define	VECT_GPTW1_GTCID1	119
#define	VECT_GPTW1_GTCIE1	120
#define	VECT_GPTW1_GTCIF1	121
#define	VECT_GPTW1_GTCIV1	122
#define	VECT_GPTW1_GTCIU1	123
#define	VECT_GPTW2_GTCIA2	124
#define	VECT_GPTW2_GTCIB2	125
#define	VECT_GPTW2_GTCIC2	126
#define	VECT_GPTW2_GTCID2	127
#define	VECT_GPTW2_GTCIE2	128
#define	VECT_GPTW2_GTCIF2	129
#define	VECT_GPTW2_GTCIV2	130
#define	VECT_GPTW2_GTCIU2	131
#define	VECT_GPTW3_GTCIA3	132
#define	VECT_GPTW3_GTCIB3	133
#define	VECT_GPTW3_GTCIC3	134
#define	VECT_GPTW3_GTCID3	135
#define	VECT_GPTW3_GTCIE3	136
#define	VECT_GPTW3_GTCIF3	137
#define	VECT_GPTW3_GTCIV3	138
#define	VECT_GPTW3_GTCIU3	139
#define	VECT_GPTW4_GTCIA4	140
#define	VECT_GPTW4_GTCIB4	141
#define	VECT_GPTW4_GTCIC4	142
#define	VECT_GPTW4_GTCID4	143
#define	VECT_GPTW4_GTCIE4	144
#define	VECT_GPTW4_GTCIF4	145
#define	VECT_GPTW4_GTCIV4	146
#define	VECT_GPTW4_GTCIU4	147
#define	VECT_GPTW5_GTCIA5	148
#define	VECT_GPTW5_GTCIB5	149
#define	VECT_GPTW5_GTCIC5	150
#define	VECT_GPTW5_GTCID5	151
#define	VECT_GPTW5_GTCIE5	152
#define	VECT_GPTW5_GTCIF5	153
#define	VECT_GPTW5_GTCIV5	154
#define	VECT_GPTW5_GTCIU5	155
#define	VECT_GPTW6_GTCIA6	156
#define	VECT_GPTW6_GTCIB6	157
#define	VECT_GPTW6_GTCIC6	158
#define	VECT_GPTW6_GTCID6	159
#define	VECT_GPTW6_GTCIE6	160
#define	VECT_GPTW6_GTCIF6	161
#define	VECT_GPTW6_GTCIV6	162
#define	VECT_GPTW6_GTCIU6	163
#define	VECT_GPTW7_GTCIA7	164
#define	VECT_GPTW7_GTCIB7	165
#define	VECT_GPTW7_GTCIC7	166
#define	VECT_GPTW7_GTCID7	167
#define	VECT_GPTW7_GTCIE7	168
#define	VECT_GPTW7_GTCIF7	169
#define	VECT_GPTW7_GTCIV7	170
#define	VECT_GPTW7_GTCIU7	171
#define	VECT_TMR0_CMIA0		174
#define	VECT_TMR0_CMIB0		175
#define	VECT_TMR0_OVI0		176
#define	VECT_TMR1_CMIA1		177
#define	VECT_TMR1_CMIB1		178
#define	VECT_TMR1_OVI1		179
#define	VECT_TMR2_CMIA2		180
#define	VECT_TMR2_CMIB2		181
#define	VECT_TMR2_OVI2		182
#define	VECT_TMR3_CMIA3		183
#define	VECT_TMR3_CMIB3		184
#define	VECT_TMR3_OVI3		185
#define	VECT_CANFD_RFRI		186
#define	VECT_CANFD_GLEI		187
#define	VECT_CANFD_RMRI		188
#define	VECT_CANFD_RFDREQ0	189
#define	VECT_CANFD_RFDREQ1	190
#define	VECT_CANFD_EC1EI	191
#define	VECT_CANFD_EC2EI	192
#define	VECT_CANFD_ECOVI	193
#define	VECT_CANFD0_CHTI	194
#define	VECT_CANFD0_CHEI	195
#define	VECT_CANFD0_CFRI	196
#define	VECT_CANFD0_CFDREQ0	197
#define	VECT_DMAC_DMAC0I	198
#define	VECT_DMAC_DMAC1I	199
#define	VECT_DMAC_DMAC2I	200
#define	VECT_DMAC_DMAC3I	201
#define	VECT_RSIP_PROC_BUSY	202
#define	VECT_RSIP_ROMOK		203
#define	VECT_RSIP_LONG_PLG	204
#define	VECT_RSIP_TEST_BUSY	205
#define	VECT_RSIP_WRRDY0	206
#define	VECT_RSIP_WRRDY2	207
#define	VECT_RSIP_RDRDY0	208
#define	VECT_RSIP_INTEGRATE_RDRDY	209
#define	VECT_RSIP_INTEGRATE_WRRDY	210
#define	VECT_RSIP_ECCERR	211
#define	VECT_RSCI9_BFD		212
#define	VECT_RSCI9_AED		213
#define	VECT_RSCI0_ERI		214
#define	VECT_RSCI0_RXI		215
#define	VECT_RSCI0_TXI		216
#define	VECT_RSCI0_TEI		217
#define	VECT_SCI1_ERI1		218
#define	VECT_SCI1_RXI1		219
#define	VECT_SCI1_TXI1		220
#define	VECT_SCI1_TEI1		221
#define	VECT_SCI5_ERI5		222
#define	VECT_SCI5_RXI5		223
#define	VECT_SCI5_TXI5		224
#define	VECT_SCI5_TEI5		225
#define	VECT_SCI6_ERI6		226
#define	VECT_SCI6_RXI6		227
#define	VECT_SCI6_TXI6		228
#define	VECT_SCI6_TEI6		229
#define	VECT_RSCI8_ERI		230
#define	VECT_RSCI8_RXI		231
#define	VECT_RSCI8_TXI		232
#define	VECT_RSCI8_TEI		233
#define	VECT_RSCI9_ERI		234
#define	VECT_RSCI9_RXI		235
#define	VECT_RSCI9_TXI		236
#define	VECT_RSCI9_TEI		237
#define	VECT_SCI12_ERI12	238
#define	VECT_SCI12_RXI12	239
#define	VECT_SCI12_TXI12	240
#define	VECT_SCI12_TEI12	241
#define	VECT_SCI12_SCIX0	242
#define	VECT_SCI12_SCIX1	243
#define	VECT_SCI12_SCIX2	244
#define	VECT_SCI12_SCIX3	245
#define	VECT_RIIC0_EEI0		246
#define	VECT_RIIC0_RXI0		247
#define	VECT_RIIC0_TXI0		248
#define	VECT_RIIC0_TEI0		249
#define	VECT_LPT_LPTCMI1	255

