renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx260/register_access/iccrx/iodefine.h
typedef enum enum_dtce {
DTCE_ICU_SWINT=27,
DTCE_CMT0_CMI0,DTCE_CMT1_CMI1,
DTCE_CMT2_CMI2,DTCE_CMT3_CMI3,
DTCE_USB0_D0FIFO0=36,DTCE_USB0_D1FIFO0,
DTCE_RSPI0_SPRI0=45,DTCE_RSPI0_SPTI0,
DTCE_CMPB_CMPB0=58,DTCE_CMPB_CMPB1,
DTCE_CTSU_CTSUWR,DTCE_CTSU_CTSURD,
DTCE_ICU_IRQ0=64,DTCE_ICU_IRQ1,DTCE_ICU_IRQ2,DTCE_ICU_IRQ3,DTCE_ICU_IRQ4,DTCE_ICU_IRQ5,DTCE_ICU_IRQ6,DTCE_ICU_IRQ7,
DTCE_S12AD_S12ADI0=102,DTCE_S12AD_GBADI,
DTCE_ELC_ELSR18I=106,DTCE_ELC_ELSR19I,
DTCE_GPTW0_GTCIA0,DTCE_GPTW0_GTCIB0,DTCE_GPTW0_GTCIC0,DTCE_GPTW0_GTCID0,DTCE_GPTW0_GTCIE0,DTCE_GPTW0_GTCIF0,DTCE_GPTW0_GTCIV0,DTCE_GPTW0_GTCIU0,
DTCE_GPTW1_GTCIA1,DTCE_GPTW1_GTCIB1,DTCE_GPTW1_GTCIC1,DTCE_GPTW1_GTCID1,DTCE_GPTW1_GTCIE1,DTCE_GPTW1_GTCIF1,DTCE_GPTW1_GTCIV1,DTCE_GPTW1_GTCIU1,
DTCE_GPTW2_GTCIA2,DTCE_GPTW2_GTCIB2,DTCE_GPTW2_GTCIC2,DTCE_GPTW2_GTCID2,DTCE_GPTW2_GTCIE2,DTCE_GPTW2_GTCIF2,DTCE_GPTW2_GTCIV2,DTCE_GPTW2_GTCIU2,
DTCE_GPTW3_GTCIA3,DTCE_GPTW3_GTCIB3,DTCE_GPTW3_GTCIC3,DTCE_GPTW3_GTCID3,DTCE_GPTW3_GTCIE3,DTCE_GPTW3_GTCIF3,DTCE_GPTW3_GTCIV3,DTCE_GPTW3_GTCIU3,
DTCE_GPTW4_GTCIA4,DTCE_GPTW4_GTCIB4,DTCE_GPTW4_GTCIC4,DTCE_GPTW4_GTCID4,DTCE_GPTW4_GTCIE4,DTCE_GPTW4_GTCIF4,DTCE_GPTW4_GTCIV4,DTCE_GPTW4_GTCIU4,
DTCE_GPTW5_GTCIA5,DTCE_GPTW5_GTCIB5,DTCE_GPTW5_GTCIC5,DTCE_GPTW5_GTCID5,DTCE_GPTW5_GTCIE5,DTCE_GPTW5_GTCIF5,DTCE_GPTW5_GTCIV5,DTCE_GPTW5_GTCIU5,
DTCE_GPTW6_GTCIA6,DTCE_GPTW6_GTCIB6,DTCE_GPTW6_GTCIC6,DTCE_GPTW6_GTCID6,DTCE_GPTW6_GTCIE6,DTCE_GPTW6_GTCIF6,DTCE_GPTW6_GTCIV6,DTCE_GPTW6_GTCIU6,
DTCE_GPTW7_GTCIA7,DTCE_GPTW7_GTCIB7,DTCE_GPTW7_GTCIC7,DTCE_GPTW7_GTCID7,DTCE_GPTW7_GTCIE7,DTCE_GPTW7_GTCIF7,DTCE_GPTW7_GTCIV7,DTCE_GPTW7_GTCIU7,
DTCE_TMR0_CMIA0=174,DTCE_TMR0_CMIB0,
DTCE_TMR1_CMIA1=177,DTCE_TMR1_CMIB1,
DTCE_TMR2_CMIA2=180,DTCE_TMR2_CMIB2,
DTCE_TMR3_CMIA3=183,DTCE_TMR3_CMIB3,
DTCE_CANFD_RFDREQ0=189,DTCE_CANFD_RFDREQ1,
DTCE_CANFD0_CFDREQ0=197,
DTCE_DMAC_DMAC0I,DTCE_DMAC_DMAC1I,DTCE_DMAC_DMAC2I,DTCE_DMAC_DMAC3I,
DTCE_RSIP_WRRDY0=206,DTCE_RSIP_WRRDY2,DTCE_RSIP_RDRDY0,DTCE_RSIP_INTEGRATE_RDRDY,DTCE_RSIP_INTEGRATE_WRRDY,
DTCE_RSCI9_AED=213,
DTCE_RSCI0_RXI=215,DTCE_RSCI0_TXI,
DTCE_SCI1_RXI1=219,DTCE_SCI1_TXI1,
DTCE_SCI5_RXI5=223,DTCE_SCI5_TXI5,
DTCE_SCI6_RXI6=227,DTCE_SCI6_TXI6,
DTCE_RSCI8_RXI=231,DTCE_RSCI8_TXI,
DTCE_RSCI9_RXI=235,DTCE_RSCI9_TXI,
DTCE_SCI12_RXI12=239,DTCE_SCI12_TXI12,
DTCE_RIIC0_RXI0=247,DTCE_RIIC0_TXI0,
DTCE_LPT_LPTCMI1=255
} enum_dtce_t;

typedef enum enum_ier {
IER_BSC_BUSERR=0x02,
IER_RAM_RAMERR=0x02,
IER_FCU_FRDYI=0x02,
IER_ICU_SWINT=0x03,
IER_CMT0_CMI0=0x03,IER_CMT1_CMI1=0x03,
IER_CMT2_CMI2=0x03,IER_CMT3_CMI3=0x03,
IER_CAC_FERRF=0x04,IER_CAC_MENDF=0x04,IER_CAC_OVFF=0x04,
IER_USB0_D0FIFO0=0x04,IER_USB0_D1FIFO0=0x04,IER_USB0_USBI0=0x04,
IER_POEG_POEGGAI=0x05,IER_POEG_POEGGBI=0x05,IER_POEG_POEGGCI=0x05,IER_POEG_POEGGDI=0x05,
IER_RSPI0_SPEI0=0x05,IER_RSPI0_SPRI0=0x05,IER_RSPI0_SPTI0=0x05,IER_RSPI0_SPII0=0x05,
IER_DOC_DOPCF=0x07,
IER_CMPB_CMPB0=0x07,IER_CMPB_CMPB1=0x07,
IER_CTSU_CTSUWR=0x07,IER_CTSU_CTSURD=0x07,IER_CTSU_CTSUFN=0x07,
IER_RTC_CUP=0x07,
IER_ICU_IRQ0=0x08,IER_ICU_IRQ1=0x08,IER_ICU_IRQ2=0x08,IER_ICU_IRQ3=0x08,IER_ICU_IRQ4=0x08,IER_ICU_IRQ5=0x08,IER_ICU_IRQ6=0x08,IER_ICU_IRQ7=0x08,
IER_ELC_ELSR8I=0x0A,
IER_SYSTEM_SNZI=0x0A,
IER_LVD_LVD1=0x0B,IER_LVD_LVD2=0x0B,
IER_USB0_USBR0=0x0B,
IER_RTC_ALM=0x0B,IER_RTC_PRD=0x0B,
IER_REMC0_REMCI0=0x0B,
IER_S12AD_S12ADI0=0x0C,IER_S12AD_GBADI=0x0C,
IER_ELC_ELSR18I=0x0D,IER_ELC_ELSR19I=0x0D,
IER_GPTW0_GTCIA0=0x0D,IER_GPTW0_GTCIB0=0x0D,IER_GPTW0_GTCIC0=0x0D,IER_GPTW0_GTCID0=0x0D,IER_GPTW0_GTCIE0=0x0E,IER_GPTW0_GTCIF0=0x0E,IER_GPTW0_GTCIV0=0x0E,IER_GPTW0_GTCIU0=0x0E,
IER_GPTW1_GTCIA1=0x0E,IER_GPTW1_GTCIB1=0x0E,IER_GPTW1_GTCIC1=0x0E,IER_GPTW1_GTCID1=0x0E,IER_GPTW1_GTCIE1=0x0F,IER_GPTW1_GTCIF1=0x0F,IER_GPTW1_GTCIV1=0x0F,IER_GPTW1_GTCIU1=0x0F,
IER_GPTW2_GTCIA2=0x0F,IER_GPTW2_GTCIB2=0x0F,IER_GPTW2_GTCIC2=0x0F,IER_GPTW2_GTCID2=0x0F,IER_GPTW2_GTCIE2=0x10,IER_GPTW2_GTCIF2=0x10,IER_GPTW2_GTCIV2=0x10,IER_GPTW2_GTCIU2=0x10,
IER_GPTW3_GTCIA3=0x10,IER_GPTW3_GTCIB3=0x10,IER_GPTW3_GTCIC3=0x10,IER_GPTW3_GTCID3=0x10,IER_GPTW3_GTCIE3=0x11,IER_GPTW3_GTCIF3=0x11,IER_GPTW3_GTCIV3=0x11,IER_GPTW3_GTCIU3=0x11,
IER_GPTW4_GTCIA4=0x11,IER_GPTW4_GTCIB4=0x11,IER_GPTW4_GTCIC4=0x11,IER_GPTW4_GTCID4=0x11,IER_GPTW4_GTCIE4=0x12,IER_GPTW4_GTCIF4=0x12,IER_GPTW4_GTCIV4=0x12,IER_GPTW4_GTCIU4=0x12,
IER_GPTW5_GTCIA5=0x12,IER_GPTW5_GTCIB5=0x12,IER_GPTW5_GTCIC5=0x12,IER_GPTW5_GTCID5=0x12,IER_GPTW5_GTCIE5=0x13,IER_GPTW5_GTCIF5=0x13,IER_GPTW5_GTCIV5=0x13,IER_GPTW5_GTCIU5=0x13,
IER_GPTW6_GTCIA6=0x13,IER_GPTW6_GTCIB6=0x13,IER_GPTW6_GTCIC6=0x13,IER_GPTW6_GTCID6=0x13,IER_GPTW6_GTCIE6=0x14,IER_GPTW6_GTCIF6=0x14,IER_GPTW6_GTCIV6=0x14,IER_GPTW6_GTCIU6=0x14,
IER_GPTW7_GTCIA7=0x14,IER_GPTW7_GTCIB7=0x14,IER_GPTW7_GTCIC7=0x14,IER_GPTW7_GTCID7=0x14,IER_GPTW7_GTCIE7=0x15,IER_GPTW7_GTCIF7=0x15,IER_GPTW7_GTCIV7=0x15,IER_GPTW7_GTCIU7=0x15,
IER_TMR0_CMIA0=0x15,IER_TMR0_CMIB0=0x15,IER_TMR0_OVI0=0x16,
IER_TMR1_CMIA1=0x16,IER_TMR1_CMIB1=0x16,IER_TMR1_OVI1=0x16,
IER_TMR2_CMIA2=0x16,IER_TMR2_CMIB2=0x16,IER_TMR2_OVI2=0x16,
IER_TMR3_CMIA3=0x16,IER_TMR3_CMIB3=0x17,IER_TMR3_OVI3=0x17,
IER_CANFD_RFRI=0x17,IER_CANFD_GLEI=0x17,IER_CANFD_RMRI=0x17,IER_CANFD_RFDREQ0=0x17,IER_CANFD_RFDREQ1=0x17,IER_CANFD_EC1EI=0x17,IER_CANFD_EC2EI=0x18,IER_CANFD_ECOVI=0x18,
IER_CANFD0_CHTI=0x18,IER_CANFD0_CHEI=0x18,IER_CANFD0_CFRI=0x18,IER_CANFD0_CFDREQ0=0x18,
IER_DMAC_DMAC0I=0x18,IER_DMAC_DMAC1I=0x18,IER_DMAC_DMAC2I=0x19,IER_DMAC_DMAC3I=0x19,
IER_RSIP_PROC_BUSY=0x19,IER_RSIP_ROMOK=0x19,IER_RSIP_LONG_PLG=0x19,IER_RSIP_TEST_BUSY=0x19,IER_RSIP_WRRDY0=0x19,
IER_RSIP_WRRDY2=0x19,IER_RSIP_RDRDY0=0x1A,IER_RSIP_INTEGRATE_RDRDY=0x1A,IER_RSIP_INTEGRATE_WRRDY=0x1A,IER_RSIP_ECCERR=0x1A,
IER_RSCI9_BFD=0x1A,IER_RSCI9_AED=0x1A,
IER_RSCI0_ERI=0x1A,IER_RSCI0_RXI=0x1A,IER_RSCI0_TXI=0x1B,IER_RSCI0_TEI=0x1B,
IER_SCI1_ERI1=0x1B,IER_SCI1_RXI1=0x1B,IER_SCI1_TXI1=0x1B,IER_SCI1_TEI1=0x1B,
IER_SCI5_ERI5=0x1B,IER_SCI5_RXI5=0x1B,IER_SCI5_TXI5=0x1C,IER_SCI5_TEI5=0x1C,
IER_SCI6_ERI6=0x1C,IER_SCI6_RXI6=0x1C,IER_SCI6_TXI6=0x1C,IER_SCI6_TEI6=0x1C,
IER_RSCI8_ERI=0x1C,IER_RSCI8_RXI=0x1C,IER_RSCI8_TXI=0x1D,IER_RSCI8_TEI=0x1D,
IER_RSCI9_ERI=0x1D,IER_RSCI9_RXI=0x1D,IER_RSCI9_TXI=0x1D,IER_RSCI9_TEI=0x1D,
IER_SCI12_ERI12=0x1D,IER_SCI12_RXI12=0x1D,IER_SCI12_TXI12=0x1E,IER_SCI12_TEI12=0x1E,IER_SCI12_SCIX0=0x1E,IER_SCI12_SCIX1=0x1E,IER_SCI12_SCIX2=0x1E,IER_SCI12_SCIX3=0x1E,
IER_RIIC0_EEI0=0x1E,IER_RIIC0_RXI0=0x1E,IER_RIIC0_TXI0=0x1F,IER_RIIC0_TEI0=0x1F,
IER_LPT_LPTCMI1=0x1F
} enum_ier_t;

typedef enum enum_ipr {
IPR_BSC_BUSERR=0,
IPR_RAM_RAMERR=0,
IPR_FCU_FRDYI=2,
IPR_ICU_SWINT=3,
IPR_CMT0_CMI0=4,IPR_CMT1_CMI1=5,
IPR_CMT2_CMI2=6,IPR_CMT3_CMI3=7,
IPR_CAC_FERRF=32,IPR_CAC_MENDF=33,IPR_CAC_OVFF=34,
IPR_USB0_D0FIFO0=36,IPR_USB0_D1FIFO0=37,IPR_USB0_USBI0=38,
IPR_POEG_POEGGAI=40,IPR_POEG_POEGGBI=41,IPR_POEG_POEGGCI=42,IPR_POEG_POEGGDI=43,
IPR_RSPI0_SPEI0=44,IPR_RSPI0_SPRI0=44,IPR_RSPI0_SPTI0=44,IPR_RSPI0_SPII0=44,
IPR_DOC_DOPCF=57,
IPR_CMPB_CMPB0=58,IPR_CMPB_CMPB1=59,
IPR_CTSU_CTSUWR=60,IPR_CTSU_CTSURD=60,IPR_CTSU_CTSUFN=60,
IPR_RTC_CUP=63,
IPR_ICU_IRQ0=64,IPR_ICU_IRQ1=65,IPR_ICU_IRQ2=66,IPR_ICU_IRQ3=67,IPR_ICU_IRQ4=68,IPR_ICU_IRQ5=69,IPR_ICU_IRQ6=70,IPR_ICU_IRQ7=71,
IPR_ELC_ELSR8I=80,
IPR_SYSTEM_SNZI=81,
IPR_LVD_LVD1=88,IPR_LVD_LVD2=89,
IPR_USB0_USBR0=90,
IPR_RTC_ALM=92,IPR_RTC_PRD=93,
IPR_REMC0_REMCI0=94,
IPR_S12AD_S12ADI0=102,IPR_S12AD_GBADI=103,
IPR_ELC_ELSR18I=106,IPR_ELC_ELSR19I=107,
IPR_GPTW0_GTCIA0=108,IPR_GPTW0_GTCIB0=108,IPR_GPTW0_GTCIC0=110,IPR_GPTW0_GTCID0=110,IPR_GPTW0_GTCIE0=110,IPR_GPTW0_GTCIF0=110,IPR_GPTW0_GTCIV0=114,IPR_GPTW0_GTCIU0=114,
IPR_GPTW1_GTCIA1=116,IPR_GPTW1_GTCIB1=116,IPR_GPTW1_GTCIC1=118,IPR_GPTW1_GTCID1=118,IPR_GPTW1_GTCIE1=118,IPR_GPTW1_GTCIF1=118,IPR_GPTW1_GTCIV1=122,IPR_GPTW1_GTCIU1=122,
IPR_GPTW2_GTCIA2=124,IPR_GPTW2_GTCIB2=124,IPR_GPTW2_GTCIC2=126,IPR_GPTW2_GTCID2=126,IPR_GPTW2_GTCIE2=126,IPR_GPTW2_GTCIF2=126,IPR_GPTW2_GTCIV2=130,IPR_GPTW2_GTCIU2=130,
IPR_GPTW3_GTCIA3=132,IPR_GPTW3_GTCIB3=132,IPR_GPTW3_GTCIC3=134,IPR_GPTW3_GTCID3=134,IPR_GPTW3_GTCIE3=134,IPR_GPTW3_GTCIF3=134,IPR_GPTW3_GTCIV3=138,IPR_GPTW3_GTCIU3=138,
IPR_GPTW4_GTCIA4=140,IPR_GPTW4_GTCIB4=140,IPR_GPTW4_GTCIC4=142,IPR_GPTW4_GTCID4=142,IPR_GPTW4_GTCIE4=142,IPR_GPTW4_GTCIF4=142,IPR_GPTW4_GTCIV4=146,IPR_GPTW4_GTCIU4=146,
IPR_GPTW5_GTCIA5=148,IPR_GPTW5_GTCIB5=148,IPR_GPTW5_GTCIC5=150,IPR_GPTW5_GTCID5=150,IPR_GPTW5_GTCIE5=150,IPR_GPTW5_GTCIF5=150,IPR_GPTW5_GTCIV5=154,IPR_GPTW5_GTCIU5=154,
IPR_GPTW6_GTCIA6=156,IPR_GPTW6_GTCIB6=156,IPR_GPTW6_GTCIC6=158,IPR_GPTW6_GTCID6=158,IPR_GPTW6_GTCIE6=158,IPR_GPTW6_GTCIF6=158,IPR_GPTW6_GTCIV6=162,IPR_GPTW6_GTCIU6=162,
IPR_GPTW7_GTCIA7=164,IPR_GPTW7_GTCIB7=164,IPR_GPTW7_GTCIC7=166,IPR_GPTW7_GTCID7=166,IPR_GPTW7_GTCIE7=166,IPR_GPTW7_GTCIF7=166,IPR_GPTW7_GTCIV7=170,IPR_GPTW7_GTCIU7=170,
IPR_TMR0_CMIA0=174,IPR_TMR0_CMIB0=174,IPR_TMR0_OVI0=174,
IPR_TMR1_CMIA1=177,IPR_TMR1_CMIB1=177,IPR_TMR1_OVI1=177,
IPR_TMR2_CMIA2=180,IPR_TMR2_CMIB2=180,IPR_TMR2_OVI2=180,
IPR_TMR3_CMIA3=183,IPR_TMR3_CMIB3=183,IPR_TMR3_OVI3=183,
IPR_CANFD_RFRI=186,IPR_CANFD_GLEI=187,IPR_CANFD_RMRI=188,IPR_CANFD_RFDREQ0=189,IPR_CANFD_RFDREQ1=190,IPR_CANFD_EC1EI=191,IPR_CANFD_EC2EI=192,IPR_CANFD_ECOVI=193,
IPR_CANFD0_CHTI=194,IPR_CANFD0_CHEI=195,IPR_CANFD0_CFRI=196,IPR_CANFD0_CFDREQ0=197,
IPR_DMAC_DMAC0I=198,IPR_DMAC_DMAC1I=199,IPR_DMAC_DMAC2I=200,IPR_DMAC_DMAC3I=201,
IPR_RSIP_PROC_BUSY=202,IPR_RSIP_ROMOK=203,IPR_RSIP_LONG_PLG=204,IPR_RSIP_TEST_BUSY=205,IPR_RSIP_WRRDY0=206,
IPR_RSIP_WRRDY2=207,IPR_RSIP_RDRDY0=208,IPR_RSIP_INTEGRATE_RDRDY=209,IPR_RSIP_INTEGRATE_WRRDY=210,IPR_RSIP_ECCERR=211,
IPR_RSCI9_BFD=212,IPR_RSCI9_AED=213,
IPR_RSCI0_ERI=214,IPR_RSCI0_RXI=214,IPR_RSCI0_TXI=214,IPR_RSCI0_TEI=214,
IPR_SCI1_ERI1=218,IPR_SCI1_RXI1=218,IPR_SCI1_TXI1=218,IPR_SCI1_TEI1=218,
IPR_SCI5_ERI5=222,IPR_SCI5_RXI5=222,IPR_SCI5_TXI5=222,IPR_SCI5_TEI5=222,
IPR_SCI6_ERI6=226,IPR_SCI6_RXI6=226,IPR_SCI6_TXI6=226,IPR_SCI6_TEI6=226,
IPR_RSCI8_ERI=230,IPR_RSCI8_RXI=230,IPR_RSCI8_TXI=230,IPR_RSCI8_TEI=230,
IPR_RSCI9_ERI=234,IPR_RSCI9_RXI=234,IPR_RSCI9_TXI=234,IPR_RSCI9_TEI=234,
IPR_SCI12_ERI12=238,IPR_SCI12_RXI12=238,IPR_SCI12_TXI12=238,IPR_SCI12_TEI12=238,IPR_SCI12_SCIX0=242,IPR_SCI12_SCIX1=243,IPR_SCI12_SCIX2=244,IPR_SCI12_SCIX3=245,
IPR_RIIC0_EEI0=246,IPR_RIIC0_RXI0=247,IPR_RIIC0_TXI0=248,IPR_RIIC0_TEI0=249,
IPR_LPT_LPTCMI1=255,
IPR_FCU_=2,
IPR_DOC_=57,
IPR_CTSU_=60,
IPR_SYSTEM_=81,
IPR_REMC0_=94,
IPR_TMR0_=174,
IPR_TMR1_=177,
IPR_TMR2_=180,
IPR_TMR3_=183,
IPR_RSCI0_=214,
IPR_SCI1_=218,
IPR_SCI5_=222,
IPR_SCI6_=226,
IPR_RSCI8_=230,
IPR_LPT_=255
} enum_ipr_t;

