renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx260/register_access/iccrx/iodefine.h
typedef struct st_gptw3 {
	union {
		unsigned long LONG;
		struct {
			unsigned long :16;
			unsigned long PRKEY:8;
			unsigned long :3;
			unsigned long CMNWP:1;
			unsigned long CLRWP:1;
			unsigned long STPWP:1;
			unsigned long STRWP:1;
			unsigned long WP:1;
		} BIT;
	} GTWP;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CSTRT7:1;
			unsigned long CSTRT6:1;
			unsigned long CSTRT5:1;
			unsigned long CSTRT4:1;
			unsigned long CSTRT3:1;
			unsigned long CSTRT2:1;
			unsigned long CSTRT1:1;
			unsigned long CSTRT0:1;
		} BIT;
	} GTSTR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CSTOP7:1;
			unsigned long CSTOP6:1;
			unsigned long CSTOP5:1;
			unsigned long CSTOP4:1;
			unsigned long CSTOP3:1;
			unsigned long CSTOP2:1;
			unsigned long CSTOP1:1;
			unsigned long CSTOP0:1;
		} BIT;
	} GTSTP;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CCLR7:1;
			unsigned long CCLR6:1;
			unsigned long CCLR5:1;
			unsigned long CCLR4:1;
			unsigned long CCLR3:1;
			unsigned long CCLR2:1;
			unsigned long CCLR1:1;
			unsigned long CCLR0:1;
		} BIT;
	} GTCLR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSTRT:1;
			unsigned long :7;
			unsigned long SSELCH:1;
			unsigned long SSELCG:1;
			unsigned long SSELCF:1;
			unsigned long SSELCE:1;
			unsigned long SSELCD:1;
			unsigned long SSELCC:1;
			unsigned long SSELCB:1;
			unsigned long SSELCA:1;
			unsigned long SSCBFAH:1;
			unsigned long SSCBFAL:1;
			unsigned long SSCBRAH:1;
			unsigned long SSCBRAL:1;
			unsigned long SSCAFBH:1;
			unsigned long SSCAFBL:1;
			unsigned long SSCARBH:1;
			unsigned long SSCARBL:1;
			unsigned long SSGTRGDF:1;
			unsigned long SSGTRGDR:1;
			unsigned long SSGTRGCF:1;
			unsigned long SSGTRGCR:1;
			unsigned long SSGTRGBF:1;
			unsigned long SSGTRGBR:1;
			unsigned long SSGTRGAF:1;
			unsigned long SSGTRGAR:1;
		} BIT;
	} GTSSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSTOP:1;
			unsigned long :7;
			unsigned long PSELCH:1;
			unsigned long PSELCG:1;
			unsigned long PSELCF:1;
			unsigned long PSELCE:1;
			unsigned long PSELCD:1;
			unsigned long PSELCC:1;
			unsigned long PSELCB:1;
			unsigned long PSELCA:1;
			unsigned long PSCBFAH:1;
			unsigned long PSCBFAL:1;
			unsigned long PSCBRAH:1;
			unsigned long PSCBRAL:1;
			unsigned long PSCAFBH:1;
			unsigned long PSCAFBL:1;
			unsigned long PSCARBH:1;
			unsigned long PSCARBL:1;
			unsigned long PSGTRGDF:1;
			unsigned long PSGTRGDR:1;
			unsigned long PSGTRGCF:1;
			unsigned long PSGTRGCR:1;
			unsigned long PSGTRGBF:1;
			unsigned long PSGTRGBR:1;
			unsigned long PSGTRGAF:1;
			unsigned long PSGTRGAR:1;
		} BIT;
	} GTPSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CCLR:1;
			unsigned long :4;
			unsigned long CSCMSC:3;
			unsigned long CSELCH:1;
			unsigned long CSELCG:1;
			unsigned long CSELCF:1;
			unsigned long CSELCE:1;
			unsigned long CSELCD:1;
			unsigned long CSELCC:1;
			unsigned long CSELCB:1;
			unsigned long CSELCA:1;
			unsigned long CSCBFAH:1;
			unsigned long CSCBFAL:1;
			unsigned long CSCBRAH:1;
			unsigned long CSCBRAL:1;
			unsigned long CSCAFBH:1;
			unsigned long CSCAFBL:1;
			unsigned long CSCARBH:1;
			unsigned long CSCARBL:1;
			unsigned long CSGTRGDF:1;
			unsigned long CSGTRGDR:1;
			unsigned long CSGTRGCF:1;
			unsigned long CSGTRGCR:1;
			unsigned long CSGTRGBF:1;
			unsigned long CSGTRGBR:1;
			unsigned long CSGTRGAF:1;
			unsigned long CSGTRGAR:1;
		} BIT;
	} GTCSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long USILVL:4;
			unsigned long USELCH:1;
			unsigned long USELCG:1;
			unsigned long USELCF:1;
			unsigned long USELCE:1;
			unsigned long USELCD:1;
			unsigned long USELCC:1;
			unsigned long USELCB:1;
			unsigned long USELCA:1;
			unsigned long USCBFAH:1;
			unsigned long USCBFAL:1;
			unsigned long USCBRAH:1;
			unsigned long USCBRAL:1;
			unsigned long USCAFBH:1;
			unsigned long USCAFBL:1;
			unsigned long USCARBH:1;
			unsigned long USCARBL:1;
			unsigned long USGTRGDF:1;
			unsigned long USGTRGDR:1;
			unsigned long USGTRGCF:1;
			unsigned long USGTRGCR:1;
			unsigned long USGTRGBF:1;
			unsigned long USGTRGBR:1;
			unsigned long USGTRGAF:1;
			unsigned long USGTRGAR:1;
		} BIT;
	} GTUPSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long DSILVL:4;
			unsigned long DSELCH:1;
			unsigned long DSELCG:1;
			unsigned long DSELCF:1;
			unsigned long DSELCE:1;
			unsigned long DSELCD:1;
			unsigned long DSELCC:1;
			unsigned long DSELCB:1;
			unsigned long DSELCA:1;
			unsigned long DSCBFAH:1;
			unsigned long DSCBFAL:1;
			unsigned long DSCBRAH:1;
			unsigned long DSCBRAL:1;
			unsigned long DSCAFBH:1;
			unsigned long DSCAFBL:1;
			unsigned long DSCARBH:1;
			unsigned long DSCARBL:1;
			unsigned long DSGTRGDF:1;
			unsigned long DSGTRGDR:1;
			unsigned long DSGTRGCF:1;
			unsigned long DSGTRGCR:1;
			unsigned long DSGTRGBF:1;
			unsigned long DSGTRGBR:1;
			unsigned long DSGTRGAF:1;
			unsigned long DSGTRGAR:1;
		} BIT;
	} GTDNSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long ASOC:1;
			unsigned long ASELCH:1;
			unsigned long ASELCG:1;
			unsigned long ASELCF:1;
			unsigned long ASELCE:1;
			unsigned long ASELCD:1;
			unsigned long ASELCC:1;
			unsigned long ASELCB:1;
			unsigned long ASELCA:1;
			unsigned long ASCBFAH:1;
			unsigned long ASCBFAL:1;
			unsigned long ASCBRAH:1;
			unsigned long ASCBRAL:1;
			unsigned long ASCAFBH:1;
			unsigned long ASCAFBL:1;
			unsigned long ASCARBH:1;
			unsigned long ASCARBL:1;
			unsigned long ASGTRGDF:1;
			unsigned long ASGTRGDR:1;
			unsigned long ASGTRGCF:1;
			unsigned long ASGTRGCR:1;
			unsigned long ASGTRGBF:1;
			unsigned long ASGTRGBR:1;
			unsigned long ASGTRGAF:1;
			unsigned long ASGTRGAR:1;
		} BIT;
	} GTICASR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long BSOC:1;
			unsigned long BSELCH:1;
			unsigned long BSELCG:1;
			unsigned long BSELCF:1;
			unsigned long BSELCE:1;
			unsigned long BSELCD:1;
			unsigned long BSELCC:1;
			unsigned long BSELCB:1;
			unsigned long BSELCA:1;
			unsigned long BSCBFAH:1;
			unsigned long BSCBFAL:1;
			unsigned long BSCBRAH:1;
			unsigned long BSCBRAL:1;
			unsigned long BSCAFBH:1;
			unsigned long BSCAFBL:1;
			unsigned long BSCARBH:1;
			unsigned long BSCARBL:1;
			unsigned long BSGTRGDF:1;
			unsigned long BSGTRGDR:1;
			unsigned long BSGTRGCF:1;
			unsigned long BSGTRGCR:1;
			unsigned long BSGTRGBF:1;
			unsigned long BSGTRGBR:1;
			unsigned long BSGTRGAF:1;
			unsigned long BSGTRGAR:1;
		} BIT;
	} GTICBSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long CKEG:2;
			unsigned long TPCS:4;
			unsigned long :4;
			unsigned long MD:3;
			unsigned long SSCEN:1;
			unsigned long :3;
			unsigned long SSCGRP:2;
			unsigned long SCGTIOC:1;
			unsigned long ICDS:1;
			unsigned long :7;
			unsigned long CST:1;
		} BIT;
	} GTCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long OBDTYR:1;
			unsigned long OBDTYF:1;
			unsigned long OBDTY:2;
			unsigned long :4;
			unsigned long OADTYR:1;
			unsigned long OADTYF:1;
			unsigned long OADTY:2;
			unsigned long :14;
			unsigned long UDF:1;
			unsigned long UD:1;
		} BIT;
	} GTUDDTYC;
	union {
		unsigned long LONG;
		struct {
			unsigned long NFCSB:2;
			unsigned long NFBEN:1;
			unsigned long :2;
			unsigned long OBDF:2;
			unsigned long OBE:1;
			unsigned long OBHLD:1;
			unsigned long OBDFLT:1;
			unsigned long :1;
			unsigned long GTIOB:5;
			unsigned long NFCSA:2;
			unsigned long NFAEN:1;
			unsigned long :2;
			unsigned long OADF:2;
			unsigned long OAE:1;
			unsigned long OAHLD:1;
			unsigned long OADFLT:1;
			unsigned long :1;
			unsigned long GTIOA:5;
		} BIT;
	} GTIOR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long GRPABL:1;
			unsigned long GRPABH:1;
			unsigned long :3;
			unsigned long GRP:2;
			unsigned long :8;
			unsigned long SCFPU:1;
			unsigned long SCFPO:1;
			unsigned long SCFF:1;
			unsigned long SCFE:1;
			unsigned long SCFD:1;
			unsigned long SCFC:1;
			unsigned long SCFB:1;
			unsigned long SCFA:1;
			unsigned long GTINTPR:2;
			unsigned long GTINTF:1;
			unsigned long GTINTE:1;
			unsigned long GTINTD:1;
			unsigned long GTINTC:1;
			unsigned long GTINTB:1;
			unsigned long GTINTA:1;
		} BIT;
	} GTINTAD;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long OABLF:1;
			unsigned long OABHF:1;
			unsigned long :4;
			unsigned long ODF:1;
			unsigned long :8;
			unsigned long TUCF:1;
			unsigned long :7;
			unsigned long TCFPU:1;
			unsigned long TCFPO:1;
			unsigned long TCFF:1;
			unsigned long TCFE:1;
			unsigned long TCFD:1;
			unsigned long TCFC:1;
			unsigned long TCFB:1;
			unsigned long TCFA:1;
		} BIT;
	} GTST;
	union {
		unsigned long LONG;
		struct {
			unsigned long :9;
			unsigned long CCRSWT:1;
			unsigned long :1;
			unsigned long PR:1;
			unsigned long CCRB:2;
			unsigned long CCRA:2;
			unsigned long :14;
			unsigned long BD:2;
		} BIT;
	} GTBER;
	char           wk0[4];
	unsigned long  GTCNT;
	unsigned long  GTCCRA;
	unsigned long  GTCCRB;
	unsigned long  GTCCRC;
	unsigned long  GTCCRE;
	unsigned long  GTCCRD;
	unsigned long  GTCCRF;
	unsigned long  GTPR;
	unsigned long  GTPBR;
	char           wk1[100];
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long SECSEL7:1;
			unsigned long SECSEL6:1;
			unsigned long SECSEL5:1;
			unsigned long SECSEL4:1;
			unsigned long SECSEL3:1;
			unsigned long SECSEL2:1;
			unsigned long SECSEL1:1;
			unsigned long SECSEL0:1;
		} BIT;
	} GTSECSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :6;
			unsigned long SSCD:1;
			unsigned long :7;
			unsigned long SSCE:1;
			unsigned long :7;
			unsigned long SBDPD:1;
			unsigned long SBDCD:1;
			unsigned long :6;
			unsigned long SBDPE:1;
			unsigned long SBDCE:1;
		} BIT;
	} GTSECR;
	char           wk2[20];
	union {
		unsigned long LONG;
		struct {
			unsigned long ICBGRP:2;
			unsigned long :5;
			unsigned long ICBCLK:1;
			unsigned long ICBFPU:1;
			unsigned long ICBFPO:1;
			unsigned long ICBFF:1;
			unsigned long ICBFE:1;
			unsigned long ICBFD:1;
			unsigned long ICBFC:1;
			unsigned long ICBFB:1;
			unsigned long ICBFA:1;
			unsigned long ICAGRP:2;
			unsigned long :5;
			unsigned long ICACLK:1;
			unsigned long ICAFPU:1;
			unsigned long ICAFPO:1;
			unsigned long ICAFF:1;
			unsigned long ICAFE:1;
			unsigned long ICAFD:1;
			unsigned long ICAFC:1;
			unsigned long ICAFB:1;
			unsigned long ICAFA:1;
		} BIT;
	} GTICCR;
} st_gptw3_t;

typedef struct st_gptw6 {
	union {
		unsigned long LONG;
		struct {
			unsigned long :16;
			unsigned long PRKEY:8;
			unsigned long :3;
			unsigned long CMNWP:1;
			unsigned long CLRWP:1;
			unsigned long STPWP:1;
			unsigned long STRWP:1;
			unsigned long WP:1;
		} BIT;
	} GTWP;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CSTRT7:1;
			unsigned long CSTRT6:1;
			unsigned long CSTRT5:1;
			unsigned long CSTRT4:1;
			unsigned long CSTRT3:1;
			unsigned long CSTRT2:1;
			unsigned long CSTRT1:1;
			unsigned long CSTRT0:1;
		} BIT;
	} GTSTR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CSTOP7:1;
			unsigned long CSTOP6:1;
			unsigned long CSTOP5:1;
			unsigned long CSTOP4:1;
			unsigned long CSTOP3:1;
			unsigned long CSTOP2:1;
			unsigned long CSTOP1:1;
			unsigned long CSTOP0:1;
		} BIT;
	} GTSTP;
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long CCLR7:1;
			unsigned long CCLR6:1;
			unsigned long CCLR5:1;
			unsigned long CCLR4:1;
			unsigned long CCLR3:1;
			unsigned long CCLR2:1;
			unsigned long CCLR1:1;
			unsigned long CCLR0:1;
		} BIT;
	} GTCLR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSTRT:1;
			unsigned long :7;
			unsigned long SSELCH:1;
			unsigned long SSELCG:1;
			unsigned long SSELCF:1;
			unsigned long SSELCE:1;
			unsigned long SSELCD:1;
			unsigned long SSELCC:1;
			unsigned long SSELCB:1;
			unsigned long SSELCA:1;
			unsigned long SSCBFAH:1;
			unsigned long SSCBFAL:1;
			unsigned long SSCBRAH:1;
			unsigned long SSCBRAL:1;
			unsigned long SSCAFBH:1;
			unsigned long SSCAFBL:1;
			unsigned long SSCARBH:1;
			unsigned long SSCARBL:1;
			unsigned long SSGTRGDF:1;
			unsigned long SSGTRGDR:1;
			unsigned long SSGTRGCF:1;
			unsigned long SSGTRGCR:1;
			unsigned long SSGTRGBF:1;
			unsigned long SSGTRGBR:1;
			unsigned long SSGTRGAF:1;
			unsigned long SSGTRGAR:1;
		} BIT;
	} GTSSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSTOP:1;
			unsigned long :7;
			unsigned long PSELCH:1;
			unsigned long PSELCG:1;
			unsigned long PSELCF:1;
			unsigned long PSELCE:1;
			unsigned long PSELCD:1;
			unsigned long PSELCC:1;
			unsigned long PSELCB:1;
			unsigned long PSELCA:1;
			unsigned long PSCBFAH:1;
			unsigned long PSCBFAL:1;
			unsigned long PSCBRAH:1;
			unsigned long PSCBRAL:1;
			unsigned long PSCAFBH:1;
			unsigned long PSCAFBL:1;
			unsigned long PSCARBH:1;
			unsigned long PSCARBL:1;
			unsigned long PSGTRGDF:1;
			unsigned long PSGTRGDR:1;
			unsigned long PSGTRGCF:1;
			unsigned long PSGTRGCR:1;
			unsigned long PSGTRGBF:1;
			unsigned long PSGTRGBR:1;
			unsigned long PSGTRGAF:1;
			unsigned long PSGTRGAR:1;
		} BIT;
	} GTPSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CCLR:1;
			unsigned long :4;
			unsigned long CSCMSC:3;
			unsigned long CSELCH:1;
			unsigned long CSELCG:1;
			unsigned long CSELCF:1;
			unsigned long CSELCE:1;
			unsigned long CSELCD:1;
			unsigned long CSELCC:1;
			unsigned long CSELCB:1;
			unsigned long CSELCA:1;
			unsigned long CSCBFAH:1;
			unsigned long CSCBFAL:1;
			unsigned long CSCBRAH:1;
			unsigned long CSCBRAL:1;
			unsigned long CSCAFBH:1;
			unsigned long CSCAFBL:1;
			unsigned long CSCARBH:1;
			unsigned long CSCARBL:1;
			unsigned long CSGTRGDF:1;
			unsigned long CSGTRGDR:1;
			unsigned long CSGTRGCF:1;
			unsigned long CSGTRGCR:1;
			unsigned long CSGTRGBF:1;
			unsigned long CSGTRGBR:1;
			unsigned long CSGTRGAF:1;
			unsigned long CSGTRGAR:1;
		} BIT;
	} GTCSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long USELCH:1;
			unsigned long USELCG:1;
			unsigned long USELCF:1;
			unsigned long USELCE:1;
			unsigned long USELCD:1;
			unsigned long USELCC:1;
			unsigned long USELCB:1;
			unsigned long USELCA:1;
			unsigned long USCBFAH:1;
			unsigned long USCBFAL:1;
			unsigned long USCBRAH:1;
			unsigned long USCBRAL:1;
			unsigned long USCAFBH:1;
			unsigned long USCAFBL:1;
			unsigned long USCARBH:1;
			unsigned long USCARBL:1;
			unsigned long USGTRGDF:1;
			unsigned long USGTRGDR:1;
			unsigned long USGTRGCF:1;
			unsigned long USGTRGCR:1;
			unsigned long USGTRGBF:1;
			unsigned long USGTRGBR:1;
			unsigned long USGTRGAF:1;
			unsigned long USGTRGAR:1;
		} BIT;
	} GTUPSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long DSELCH:1;
			unsigned long DSELCG:1;
			unsigned long DSELCF:1;
			unsigned long DSELCE:1;
			unsigned long DSELCD:1;
			unsigned long DSELCC:1;
			unsigned long DSELCB:1;
			unsigned long DSELCA:1;
			unsigned long DSCBFAH:1;
			unsigned long DSCBFAL:1;
			unsigned long DSCBRAH:1;
			unsigned long DSCBRAL:1;
			unsigned long DSCAFBH:1;
			unsigned long DSCAFBL:1;
			unsigned long DSCARBH:1;
			unsigned long DSCARBL:1;
			unsigned long DSGTRGDF:1;
			unsigned long DSGTRGDR:1;
			unsigned long DSGTRGCF:1;
			unsigned long DSGTRGCR:1;
			unsigned long DSGTRGBF:1;
			unsigned long DSGTRGBR:1;
			unsigned long DSGTRGAF:1;
			unsigned long DSGTRGAR:1;
		} BIT;
	} GTDNSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long ASOC:1;
			unsigned long ASELCH:1;
			unsigned long ASELCG:1;
			unsigned long ASELCF:1;
			unsigned long ASELCE:1;
			unsigned long ASELCD:1;
			unsigned long ASELCC:1;
			unsigned long ASELCB:1;
			unsigned long ASELCA:1;
			unsigned long ASCBFAH:1;
			unsigned long ASCBFAL:1;
			unsigned long ASCBRAH:1;
			unsigned long ASCBRAL:1;
			unsigned long ASCAFBH:1;
			unsigned long ASCAFBL:1;
			unsigned long ASCARBH:1;
			unsigned long ASCARBL:1;
			unsigned long ASGTRGDF:1;
			unsigned long ASGTRGDR:1;
			unsigned long ASGTRGCF:1;
			unsigned long ASGTRGCR:1;
			unsigned long ASGTRGBF:1;
			unsigned long ASGTRGBR:1;
			unsigned long ASGTRGAF:1;
			unsigned long ASGTRGAR:1;
		} BIT;
	} GTICASR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long BSOC:1;
			unsigned long BSELCH:1;
			unsigned long BSELCG:1;
			unsigned long BSELCF:1;
			unsigned long BSELCE:1;
			unsigned long BSELCD:1;
			unsigned long BSELCC:1;
			unsigned long BSELCB:1;
			unsigned long BSELCA:1;
			unsigned long BSCBFAH:1;
			unsigned long BSCBFAL:1;
			unsigned long BSCBRAH:1;
			unsigned long BSCBRAL:1;
			unsigned long BSCAFBH:1;
			unsigned long BSCAFBL:1;
			unsigned long BSCARBH:1;
			unsigned long BSCARBL:1;
			unsigned long BSGTRGDF:1;
			unsigned long BSGTRGDR:1;
			unsigned long BSGTRGCF:1;
			unsigned long BSGTRGCR:1;
			unsigned long BSGTRGBF:1;
			unsigned long BSGTRGBR:1;
			unsigned long BSGTRGAF:1;
			unsigned long BSGTRGAR:1;
		} BIT;
	} GTICBSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long CKEG:2;
			unsigned long TPCS:4;
			unsigned long :4;
			unsigned long MD:3;
			unsigned long SSCEN:1;
			unsigned long :3;
			unsigned long SSCGRP:2;
			unsigned long SCGTIOC:1;
			unsigned long ICDS:1;
			unsigned long :7;
			unsigned long CST:1;
		} BIT;
	} GTCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long OBDTYR:1;
			unsigned long OBDTYF:1;
			unsigned long OBDTY:2;
			unsigned long :4;
			unsigned long OADTYR:1;
			unsigned long OADTYF:1;
			unsigned long OADTY:2;
			unsigned long :14;
			unsigned long UDF:1;
			unsigned long UD:1;
		} BIT;
	} GTUDDTYC;
	union {
		unsigned long LONG;
		struct {
			unsigned long NFCSB:2;
			unsigned long NFBEN:1;
			unsigned long :2;
			unsigned long OBDF:2;
			unsigned long OBE:1;
			unsigned long OBHLD:1;
			unsigned long OBDFLT:1;
			unsigned long :1;
			unsigned long GTIOB:5;
			unsigned long NFCSA:2;
			unsigned long NFAEN:1;
			unsigned long :2;
			unsigned long OADF:2;
			unsigned long OAE:1;
			unsigned long OAHLD:1;
			unsigned long OADFLT:1;
			unsigned long :1;
			unsigned long GTIOA:5;
		} BIT;
	} GTIOR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long GRPABL:1;
			unsigned long GRPABH:1;
			unsigned long :3;
			unsigned long GRP:2;
			unsigned long :8;
			unsigned long SCFPU:1;
			unsigned long SCFPO:1;
			unsigned long SCFF:1;
			unsigned long SCFE:1;
			unsigned long SCFD:1;
			unsigned long SCFC:1;
			unsigned long SCFB:1;
			unsigned long SCFA:1;
			unsigned long GTINTPR:2;
			unsigned long GTINTF:1;
			unsigned long GTINTE:1;
			unsigned long GTINTD:1;
			unsigned long GTINTC:1;
			unsigned long GTINTB:1;
			unsigned long GTINTA:1;
		} BIT;
	} GTINTAD;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long OABLF:1;
			unsigned long OABHF:1;
			unsigned long :4;
			unsigned long ODF:1;
			unsigned long :8;
			unsigned long TUCF:1;
			unsigned long :7;
			unsigned long TCFPU:1;
			unsigned long TCFPO:1;
			unsigned long TCFF:1;
			unsigned long TCFE:1;
			unsigned long TCFD:1;
			unsigned long TCFC:1;
			unsigned long TCFB:1;
			unsigned long TCFA:1;
		} BIT;
	} GTST;
	union {
		unsigned long LONG;
		struct {
			unsigned long :9;
			unsigned long CCRSWT:1;
			unsigned long :1;
			unsigned long PR:1;
			unsigned long CCRB:2;
			unsigned long CCRA:2;
			unsigned long :14;
			unsigned long BD:2;
		} BIT;
	} GTBER;
	char           wk0[4];
	unsigned long  GTCNT;
	unsigned long  GTCCRA;
	unsigned long  GTCCRB;
	unsigned long  GTCCRC;
	unsigned long  GTCCRE;
	unsigned long  GTCCRD;
	unsigned long  GTCCRF;
	unsigned long  GTPR;
	unsigned long  GTPBR;
	char           wk1[100];
	union {
		unsigned long LONG;
		struct {
			unsigned long :24;
			unsigned long SECSEL7:1;
			unsigned long SECSEL6:1;
			unsigned long SECSEL5:1;
			unsigned long SECSEL4:1;
			unsigned long SECSEL3:1;
			unsigned long SECSEL2:1;
			unsigned long SECSEL1:1;
			unsigned long SECSEL0:1;
		} BIT;
	} GTSECSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :6;
			unsigned long SSCD:1;
			unsigned long :7;
			unsigned long SSCE:1;
			unsigned long :7;
			unsigned long SBDPD:1;
			unsigned long SBDCD:1;
			unsigned long :6;
			unsigned long SBDPE:1;
			unsigned long SBDCE:1;
		} BIT;
	} GTSECR;
	char           wk2[20];
	union {
		unsigned long LONG;
		struct {
			unsigned long ICBGRP:2;
			unsigned long :5;
			unsigned long ICBCLK:1;
			unsigned long ICBFPU:1;
			unsigned long ICBFPO:1;
			unsigned long ICBFF:1;
			unsigned long ICBFE:1;
			unsigned long ICBFD:1;
			unsigned long ICBFC:1;
			unsigned long ICBFB:1;
			unsigned long ICBFA:1;
			unsigned long ICAGRP:2;
			unsigned long :5;
			unsigned long ICACLK:1;
			unsigned long ICAFPU:1;
			unsigned long ICAFPO:1;
			unsigned long ICAFF:1;
			unsigned long ICAFE:1;
			unsigned long ICAFD:1;
			unsigned long ICAFC:1;
			unsigned long ICAFB:1;
			unsigned long ICAFA:1;
		} BIT;
	} GTICCR;
} st_gptw6_t;

