renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx260/register_access/iccrx/iodefine.h
typedef struct st_rsci0 {
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned char LL;
			unsigned char LH;
			unsigned char HL;
			unsigned char HH;
		} BYTE;
		struct {
			unsigned long :3;
			unsigned long AFER:1;
			unsigned long APER:1;
			unsigned long :2;
			unsigned long ORER:1;
			unsigned long :14;
			unsigned long MPB:1;
			unsigned long RDAT:9;
		} BIT;
	} RDR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned char LL;
			unsigned char LH;
			unsigned char HL;
			unsigned char HH;
		} BYTE;
		struct {
			unsigned long :19;
			unsigned long SYNC:1;
			unsigned long :2;
			unsigned long MPBT:1;
			unsigned long TDAT:9;
		} BIT;
	} TDR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long SSE:1;
			unsigned long :2;
			unsigned long TEIE:1;
			unsigned long TIE:1;
			unsigned long :3;
			unsigned long RIE:1;
			unsigned long :5;
			unsigned long IDSEL:1;
			unsigned long DCME:1;
			unsigned long MPIE:1;
			unsigned long :3;
			unsigned long TE:1;
			unsigned long :3;
			unsigned long RE:1;
		} BIT;
	} SCR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long NFEN:1;
			unsigned long :1;
			unsigned long NFCS:3;
			unsigned long :3;
			unsigned long HDSEL:1;
			unsigned long :3;
			unsigned long LOOP:1;
			unsigned long :2;
			unsigned long RINV:1;
			unsigned long TINV:1;
			unsigned long :2;
			unsigned long PM:1;
			unsigned long PE:1;
			unsigned long :2;
			unsigned long SPB2IO:1;
			unsigned long SPB2DT:1;
			unsigned long :2;
			unsigned long CRSEP:1;
			unsigned long CTSE:1;
		} BIT;
	} SCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long MDDR:8;
			unsigned long :2;
			unsigned long CKS:2;
			unsigned long :3;
			unsigned long BRME:1;
			unsigned long BRR:8;
			unsigned long :1;
			unsigned long ABCSE:1;
			unsigned long ABCS:1;
			unsigned long BGDM:1;
			unsigned long :1;
			unsigned long BCP:3;
		} BIT;
	} SCR2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long BLK:1;
			unsigned long GM:1;
			unsigned long :2;
			unsigned long CKE:2;
			unsigned long :2;
			unsigned long DEEN:1;
			unsigned long :1;
			unsigned long MP:1;
			unsigned long MOD:3;
			unsigned long RXDESEL:1;
			unsigned long STOP:1;
			unsigned long DINV:1;
			unsigned long DDIR:1;
			unsigned long :2;
			unsigned long CHR:2;
			unsigned long SYNDIS:1;
			unsigned long :5;
			unsigned long CPOL:1;
			unsigned long CPHA:1;
		} BIT;
	} SCR3;
	union {
		unsigned long LONG;
		struct {
			unsigned long TTMG:4;
			unsigned long RTMG:4;
			unsigned long :6;
			unsigned long TTADJ:1;
			unsigned long RTADJ:1;
			unsigned long :7;
			unsigned long CMPD:9;
		} BIT;
	} SCR4;
	char           wk0[2];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char LPS:1;
			unsigned char AOE:1;
			unsigned char :1;
			unsigned char HBSE:1;
		} BIT;
	} HBSCR;
	char           wk1[1];
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long IICSCLS:2;
			unsigned long IICSDAS:2;
			unsigned long :1;
			unsigned long IICSTPREQ:1;
			unsigned long IICRSTAREQ:1;
			unsigned long IICSTAREQ:1;
			unsigned long :2;
			unsigned long IICACKT:1;
			unsigned long :3;
			unsigned long IICCSC:1;
			unsigned long IICINTM:1;
			unsigned long :3;
			unsigned long IICDL:5;
		} BIT;
	} SIMR;
	char           wk2[12];
	union {
		unsigned long LONG;
		struct {
			unsigned long :11;
			unsigned long DEHLD:5;
			unsigned long :3;
			unsigned long DESU:5;
			unsigned long :7;
			unsigned long DELVL:1;
		} BIT;
	} DECR;
	char           wk3[20];
	union {
		unsigned long LONG;
		struct {
			unsigned long RDRF:1;
			unsigned long TEND:1;
			unsigned long TDRE:1;
			unsigned long AFER:1;
			unsigned long APER:1;
			unsigned long MFF:1;
			unsigned long :1;
			unsigned long ORER:1;
			unsigned long :5;
			unsigned long DFER:1;
			unsigned long DPER:1;
			unsigned long DCMF:1;
			unsigned long RXDMON:1;
			unsigned long :10;
			unsigned long ERS:1;
			unsigned long :4;
		} BIT;
	} SSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long IICSTIF:1;
			unsigned long :2;
			unsigned long IICACKR:1;
		} BIT;
	} SISR;
	char           wk4[24];
	union {
		unsigned long LONG;
		struct {
			unsigned long RDRFC:1;
			unsigned long :1;
			unsigned long TDREC:1;
			unsigned long AFERC:1;
			unsigned long APERC:1;
			unsigned long MFFC:1;
			unsigned long :1;
			unsigned long ORERC:1;
			unsigned long :5;
			unsigned long DFERC:1;
			unsigned long DPERC:1;
			unsigned long DCMFC:1;
			unsigned long :11;
			unsigned long ERSC:1;
			unsigned long :4;
		} BIT;
	} SSCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long IICSTIFC:1;
			unsigned long :3;
		} BIT;
	} SISCR;
} st_rsci0_t;

typedef struct st_rsci9 {
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned char LL;
			unsigned char LH;
			unsigned char HL;
			unsigned char HH;
		} BYTE;
		struct {
			unsigned long :3;
			unsigned long AFER:1;
			unsigned long APER:1;
			unsigned long :2;
			unsigned long ORER:1;
			unsigned long :14;
			unsigned long MPB:1;
			unsigned long RDAT:9;
		} BIT;
	} RDR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned char LL;
			unsigned char LH;
			unsigned char HL;
			unsigned char HH;
		} BYTE;
		struct {
			unsigned long :19;
			unsigned long SYNC:1;
			unsigned long :2;
			unsigned long MPBT:1;
			unsigned long TDAT:9;
		} BIT;
	} TDR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :7;
			unsigned long SSE:1;
			unsigned long :2;
			unsigned long TEIE:1;
			unsigned long TIE:1;
			unsigned long :3;
			unsigned long RIE:1;
			unsigned long :5;
			unsigned long IDSEL:1;
			unsigned long DCME:1;
			unsigned long MPIE:1;
			unsigned long :3;
			unsigned long TE:1;
			unsigned long :3;
			unsigned long RE:1;
		} BIT;
	} SCR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long NFEN:1;
			unsigned long :1;
			unsigned long NFCS:3;
			unsigned long :3;
			unsigned long HDSEL:1;
			unsigned long :3;
			unsigned long LOOP:1;
			unsigned long :2;
			unsigned long RINV:1;
			unsigned long TINV:1;
			unsigned long :2;
			unsigned long PM:1;
			unsigned long PE:1;
			unsigned long :2;
			unsigned long SPB2IO:1;
			unsigned long SPB2DT:1;
			unsigned long :2;
			unsigned long CRSEP:1;
			unsigned long CTSE:1;
		} BIT;
	} SCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long MDDR:8;
			unsigned long :2;
			unsigned long CKS:2;
			unsigned long :3;
			unsigned long BRME:1;
			unsigned long BRR:8;
			unsigned long :1;
			unsigned long ABCSE:1;
			unsigned long ABCS:1;
			unsigned long BGDM:1;
			unsigned long :1;
			unsigned long BCP:3;
		} BIT;
	} SCR2;
	union {
		unsigned long LONG;
		struct {
			unsigned long :2;
			unsigned long BLK:1;
			unsigned long GM:1;
			unsigned long :2;
			unsigned long CKE:2;
			unsigned long :2;
			unsigned long DEEN:1;
			unsigned long :1;
			unsigned long MP:1;
			unsigned long MOD:3;
			unsigned long RXDESEL:1;
			unsigned long STOP:1;
			unsigned long DINV:1;
			unsigned long DDIR:1;
			unsigned long :2;
			unsigned long CHR:2;
			unsigned long SYNDIS:1;
			unsigned long :5;
			unsigned long CPOL:1;
			unsigned long CPHA:1;
		} BIT;
	} SCR3;
	union {
		unsigned long LONG;
		struct {
			unsigned long TTMG:4;
			unsigned long RTMG:4;
			unsigned long :6;
			unsigned long TTADJ:1;
			unsigned long RTADJ:1;
			unsigned long :7;
			unsigned long CMPD:9;
		} BIT;
	} SCR4;
	char           wk0[2];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char LPS:1;
			unsigned char AOE:1;
			unsigned char :1;
			unsigned char HBSE:1;
		} BIT;
	} HBSCR;
	char           wk1[1];
	union {
		unsigned long LONG;
		struct {
			unsigned long :8;
			unsigned long IICSCLS:2;
			unsigned long IICSDAS:2;
			unsigned long :1;
			unsigned long IICSTPREQ:1;
			unsigned long IICRSTAREQ:1;
			unsigned long IICSTAREQ:1;
			unsigned long :2;
			unsigned long IICACKT:1;
			unsigned long :3;
			unsigned long IICCSC:1;
			unsigned long IICINTM:1;
			unsigned long :3;
			unsigned long IICDL:5;
		} BIT;
	} SIMR;
	char           wk2[8];
	union {
		unsigned long LONG;
		struct {
			unsigned long :5;
			unsigned long SBERIE:1;
			unsigned long SYERIE:1;
			unsigned long PFERIE:1;
			unsigned long :2;
			unsigned long RPPAT:2;
			unsigned long RPLEN:4;
			unsigned long :2;
			unsigned long TPPAT:2;
			unsigned long TPLEN:4;
			unsigned long :1;
			unsigned long SBLEN:1;
			unsigned long SYNCE:1;
			unsigned long SBPTN:1;
			unsigned long :1;
			unsigned long SADJE:1;
			unsigned long ENCS:1;
			unsigned long DECS:1;
		} BIT;
	} MMCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :11;
			unsigned long DEHLD:5;
			unsigned long :3;
			unsigned long DESU:5;
			unsigned long :7;
			unsigned long DELVL:1;
		} BIT;
	} DECR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :6;
			unsigned long BCCS:2;
			unsigned long :1;
			unsigned long AEDIE:1;
			unsigned long COFIE:1;
			unsigned long BFDIE:1;
			unsigned long :2;
			unsigned long BCDIE:1;
			unsigned long BFOIE:1;
			unsigned long PIBS:3;
			unsigned long PIBE:1;
			unsigned long CF1DS:2;
			unsigned long CF0RE:1;
			unsigned long BFE:1;
			unsigned long :6;
			unsigned long TCSS:2;
		} BIT;
	} XCR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long CF1CE:8;
			unsigned long SCF1D:8;
			unsigned long PCF1D:8;
			unsigned long :2;
			unsigned long BRME:1;
			unsigned long SDST:1;
			unsigned long :3;
			unsigned long TCST:1;
		} BIT;
	} XCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long BFLW:16;
			unsigned long CF0CE:8;
			unsigned long CF0D:8;
		} BIT;
	} XCR2;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			unsigned long RDRF:1;
			unsigned long TEND:1;
			unsigned long TDRE:1;
			unsigned long AFER:1;
			unsigned long APER:1;
			unsigned long MFF:1;
			unsigned long :1;
			unsigned long ORER:1;
			unsigned long :5;
			unsigned long DFER:1;
			unsigned long DPER:1;
			unsigned long DCMF:1;
			unsigned long RXDMON:1;
			unsigned long :10;
			unsigned long ERS:1;
			unsigned long :4;
		} BIT;
	} SSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long IICSTIF:1;
			unsigned long :2;
			unsigned long IICACKR:1;
		} BIT;
	} SISR;
	char           wk4[8];
	union {
		unsigned long LONG;
		struct {
			unsigned long :25;
			unsigned long RSYNC:1;
			unsigned long :1;
			unsigned long MCER:1;
			unsigned long :1;
			unsigned long SBER:1;
			unsigned long SYER:1;
			unsigned long PFER:1;
		} BIT;
	} MMSR;
	union {
		unsigned long LONG;
		struct {
			unsigned long CF1RD:8;
			unsigned long CF0RD:8;
			unsigned long AEDF:1;
			unsigned long COF:1;
			unsigned long PIBDF:1;
			unsigned long CF1MF:1;
			unsigned long CF0MF:1;
			unsigned long BFDF:1;
			unsigned long BCDF:1;
			unsigned long BFOF:1;
			unsigned long :6;
			unsigned long RXDSF:1;
			unsigned long SFSF:1;
		} BIT;
	} XSR0;
	union {
		unsigned long LONG;
		struct {
			unsigned long :16;
			unsigned long CCV:16;
		} BIT;
	} XSR1;
	char           wk5[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long RDRFC:1;
			unsigned long :1;
			unsigned long TDREC:1;
			unsigned long AFERC:1;
			unsigned long APERC:1;
			unsigned long MFFC:1;
			unsigned long :1;
			unsigned long ORERC:1;
			unsigned long :5;
			unsigned long DFERC:1;
			unsigned long DPERC:1;
			unsigned long DCMFC:1;
			unsigned long :11;
			unsigned long ERSC:1;
			unsigned long :4;
		} BIT;
	} SSCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :28;
			unsigned long IICSTIFC:1;
			unsigned long :3;
		} BIT;
	} SISCR;
	char           wk6[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long :27;
			unsigned long MCERC:1;
			unsigned long :1;
			unsigned long SBERC:1;
			unsigned long SYERC:1;
			unsigned long PFERC:1;
		} BIT;
	} MMSCR;
	union {
		unsigned long LONG;
		struct {
			unsigned long :16;
			unsigned long AEDCL:1;
			unsigned long COFC:1;
			unsigned long PIBDCL:1;
			unsigned long CF1MCL:1;
			unsigned long CF0MCL:1;
			unsigned long BFDCL:1;
			unsigned long BCDCL:1;
			unsigned long BFOC:1;
			unsigned long :8;
		} BIT;
	} XSCR;
} st_rsci9_t;

typedef struct st_rspi {
	union {
		unsigned char BYTE;
		struct {
			unsigned char SPRIE:1;
			unsigned char SPE:1;
			unsigned char SPTIE:1;
			unsigned char SPEIE:1;
			unsigned char MSTR:1;
			unsigned char MODFEN:1;
			unsigned char TXMD:1;
			unsigned char SPMS:1;
		} BIT;
	} SPCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char SSL3P:1;
			unsigned char SSL2P:1;
			unsigned char SSL1P:1;
			unsigned char SSL0P:1;
		} BIT;
	} SSLP;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char MOIFE:1;
			unsigned char MOIFV:1;
			unsigned char :2;
			unsigned char SPLP2:1;
			unsigned char SPLP:1;
		} BIT;
	} SPPCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char SPRF:1;
			unsigned char :1;
			unsigned char SPTEF:1;
			unsigned char UDRF:1;
			unsigned char PERF:1;
			unsigned char MODF:1;
			unsigned char IDLNF:1;
			unsigned char OVRF:1;
		} BIT;
	} SPSR;
	union {
		unsigned long LONG;
		struct {
			unsigned short H;
		} WORD;
		struct {
			unsigned char HH;
		} BYTE;
	} SPDR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char SPSLN:3;
		} BIT;
	} SPSCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :1;
			unsigned char SPECM:3;
			unsigned char :1;
			unsigned char SPCP:3;
		} BIT;
	} SPSSR;
	unsigned char  SPBR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :1;
			unsigned char SPBYT:1;
			unsigned char SPLW:1;
			unsigned char SPRDTD:1;
			unsigned char :2;
			unsigned char SPFC:2;
		} BIT;
	} SPDCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char SCKDL:3;
		} BIT;
	} SPCKD;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char SLNDL:3;
		} BIT;
	} SSLND;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char SPNDL:3;
		} BIT;
	} SPND;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char SCKASE:1;
			unsigned char PTE:1;
			unsigned char SPIIE:1;
			unsigned char SPOE:1;
			unsigned char SPPE:1;
		} BIT;
	} SPCR2;
	union {
		unsigned short WORD;
		struct {
			unsigned short SCKDEN:1;
			unsigned short SLNDEN:1;
			unsigned short SPNDEN:1;
			unsigned short LSBF:1;
			unsigned short SPB:4;
			unsigned short SSLKP:1;
			unsigned short SSLA:3;
			unsigned short BRDV:2;
			unsigned short CPOL:1;
			unsigned short CPHA:1;
		} BIT;
	} SPCMD0;
	union {
		unsigned short WORD;
		struct {
			unsigned short SCKDEN:1;
			unsigned short SLNDEN:1;
			unsigned short SPNDEN:1;
			unsigned short LSBF:1;
			unsigned short SPB:4;
			unsigned short SSLKP:1;
			unsigned short SSLA:3;
			unsigned short BRDV:2;
			unsigned short CPOL:1;
			unsigned short CPHA:1;
		} BIT;
	} SPCMD1;
	union {
		unsigned short WORD;
		struct {
			unsigned short SCKDEN:1;
			unsigned short SLNDEN:1;
			unsigned short SPNDEN:1;
			unsigned short LSBF:1;
			unsigned short SPB:4;
			unsigned short SSLKP:1;
			unsigned short SSLA:3;
			unsigned short BRDV:2;
			unsigned short CPOL:1;
			unsigned short CPHA:1;
		} BIT;
	} SPCMD2;
	union {
		unsigned short WORD;
		struct {
			unsigned short SCKDEN:1;
			unsigned short SLNDEN:1;
			unsigned short SPNDEN:1;
			unsigned short LSBF:1;
			unsigned short SPB:4;
			unsigned short SSLKP:1;
			unsigned short SSLA:3;
			unsigned short BRDV:2;
			unsigned short CPOL:1;
			unsigned short CPHA:1;
		} BIT;
	} SPCMD3;
	union {
		unsigned short WORD;
		struct {
			unsigned short SCKDEN:1;
			unsigned short SLNDEN:1;
			unsigned short SPNDEN:1;
			unsigned short LSBF:1;
			unsigned short SPB:4;
			unsigned short SSLKP:1;
			unsigned short SSLA:3;
			unsigned short BRDV:2;
			unsigned short CPOL:1;
			unsigned short CPHA:1;
		} BIT;
	} SPCMD4;
	union {
		unsigned short WORD;
		struct {
			unsigned short SCKDEN:1;
			unsigned short SLNDEN:1;
			unsigned short SPNDEN:1;
			unsigned short LSBF:1;
			unsigned short SPB:4;
			unsigned short SSLKP:1;
			unsigned short SSLA:3;
			unsigned short BRDV:2;
			unsigned short CPOL:1;
			unsigned short CPHA:1;
		} BIT;
	} SPCMD5;
	union {
		unsigned short WORD;
		struct {
			unsigned short SCKDEN:1;
			unsigned short SLNDEN:1;
			unsigned short SPNDEN:1;
			unsigned short LSBF:1;
			unsigned short SPB:4;
			unsigned short SSLKP:1;
			unsigned short SSLA:3;
			unsigned short BRDV:2;
			unsigned short CPOL:1;
			unsigned short CPHA:1;
		} BIT;
	} SPCMD6;
	union {
		unsigned short WORD;
		struct {
			unsigned short SCKDEN:1;
			unsigned short SLNDEN:1;
			unsigned short SPNDEN:1;
			unsigned short LSBF:1;
			unsigned short SPB:4;
			unsigned short SSLKP:1;
			unsigned short SSLA:3;
			unsigned short BRDV:2;
			unsigned short CPOL:1;
			unsigned short CPHA:1;
		} BIT;
	} SPCMD7;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char BYSW:1;
		} BIT;
	} SPDCR2;
} st_rspi_t;

